In [22]:
import mysql.connector as conn
import pandas as pd

In [4]:
mydb=conn.connect(host='localhost', user='root',password='mysql')

In [5]:
cursor=mydb.cursor()

In [6]:
cursor.execute('show databases')

In [7]:
cursor.fetchall()

[('bank',),
 ('ineuron',),
 ('ineuron1',),
 ('information_schema',),
 ('mysql',),
 ('org',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [8]:
cursor.execute('use org')

In [9]:
cursor.execute('show tables')

In [10]:
cursor.fetchall()

[('data',), ('worker',)]

In [11]:
cursor.execute('select * from worker')

In [13]:
cursor.fetchall()

[]

In [14]:
cursor.execute("INSERT into WORKER values (001, 'Monica', 'Arora', 100000, 'HR'), (002, 'Niharika', 'Verma', 80000, 'Admin'), (003, 'Vishal', 'Singhal', 300000, 'HR'),(004, 'Amitabh', 'Singh', 500000, 'Admin'), (005, 'Vivek', 'Bhati', 500000, 'Admin'), (006, 'Vipul', 'Diwan', 200000, 'Account'), (007, 'Satish', 'Kumar', 75000, 'Account'), (008, 'Geetika', 'Chauhan', 90000, 'Admin');")

In [15]:
cursor.execute('select * from worker')

In [16]:
cursor.fetchall()

[(1, 'Monica', 'Arora', 100000, 'HR'),
 (2, 'Niharika', 'Verma', 80000, 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, 'HR'),
 (4, 'Amitabh', 'Singh', 500000, 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, 'Account'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin')]

# Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [35]:
cursor.execute('select replace(first_name,"a","A") from worker')

In [36]:
cursor.fetchall()

[('MonicA',),
 ('NihArikA',),
 ('VishAl',),
 ('AmitAbh',),
 ('Vivek',),
 ('Vipul',),
 ('SAtish',),
 ('GeetikA',)]

# Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [19]:
cursor.execute('select * from worker order by FIRST_NAME asc , department desc')

In [20]:
cursor.fetchall()

[(4, 'Amitabh', 'Singh', 500000, 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin'),
 (1, 'Monica', 'Arora', 100000, 'HR'),
 (2, 'Niharika', 'Verma', 80000, 'Admin'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (6, 'Vipul', 'Diwan', 200000, 'Account'),
 (3, 'Vishal', 'Singhal', 300000, 'HR'),
 (5, 'Vivek', 'Bhati', 500000, 'Admin')]

In [23]:
pd.read_sql('select * from worker order by FIRST_NAME asc , department desc',mydb)

   WORKER_ID FIRST_NAME LAST_NAME    WAGE DEPARTMENT
0          4    Amitabh     Singh  500000      Admin
1          8    Geetika   Chauhan   90000      Admin
2          1     Monica     Arora  100000         HR
3          2   Niharika     Verma   80000      Admin
4          7     Satish     Kumar   75000    Account
5          6      Vipul     Diwan  200000    Account
6          3     Vishal   Singhal  300000         HR
7          5      Vivek     Bhati  500000      Admin

# Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [29]:
cursor.execute('select first_name from worker where wage=(select max(wage) from worker) ')

In [30]:
cursor.fetchall()

[('Amitabh',), ('Vivek',)]